#!/usr/bin/env python
# -*- coding:utf-8 -*-


##################################################################
# 练习4. 控制台打印菱形、圆
#       *
#     *   *
#    *     *
#   *       *
#  *         *
#   *       *
#    *     *
#     *   *
#       *
##################################################################


# 打印菱形

# 先分析菱形形成的规律：发现菱形是由空格、菱形组合而成，规律是： 空格、*、空格、*

N = int(input("请输入菱形的水平高度："))

# 先打印上半部分
for i in range(N):
    if i == 0:
        print(" "*(N - 1 - i) + "*")
    else:
        s = " "*(N - 1 - i) + "*" + (i * 2 - 1) * " " + "*"
        print(s)
# 再打印下半部分
for i in range(1, N):
    if i == N - 1:
        print(" " * i + "*")
    else:
        s = " " * i + "*" + ((N - 1 - i) * 2 - 1) * " " + "*"
        print(s)

# 打印圆

print("圆：")
R = 3

# 圆的高度是2R，在2R的高度里逐行（h）打印每一个点, ps : + 1 是为了把最后一行 h = 2R 的时候打印出来
for h in range(2 * R + 1):
    # 先计算每一行（h）圆中间的空格占了多少
    w = (R ** 2 - (R - h) ** 2) ** 0.5
    medium = round(w * 2)   # 四舍五入方法
    # 再计算每一行中圆左边的空格占了多少
    start = round(R - w)
    # 开始打印这一行圆： 空格 + * + 空格  + *
    print("  " * start + "*" + "  " * medium + "*")


